backend/tests/load/forum-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: "Warm up phase"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 50
      rampTo: 0
      name: "Cool down phase"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Forum Load Test"
    flow:
      - function: "generateTestUser"
      - function: "loginUser"
      - function: "getAuthToken"
      
      # Thread operations
      - get:
          url: "/api/threads"
          headers:
            Authorization: "Bearer {{ token }}"
      - post:
          url: "/api/threads"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            title: "Test Thread {{ $randomString }}"
            content: "Test content {{ $randomString }}"
            category: "general"
      - get:
          url: "/api/threads/{{ threadId }}"
          headers:
            Authorization: "Bearer {{ token }}"
      
      # Post operations
      - post:
          url: "/api/threads/{{ threadId }}/posts"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            content: "Test post content {{ $randomString }}"
      
      # User operations
      - get:
          url: "/api/users/profile"
          headers:
            Authorization: "Bearer {{ token }}"
      
      # Search operations
      - get:
          url: "/api/search?q=test"
          headers:
            Authorization: "Bearer {{ token }}"
      
      # File operations
      - post:
          url: "/api/files/upload"
          headers:
            Authorization: "Bearer {{ token }}"
          formData:
            file:
              path: "./test-files/test.txt"
              contentType: "text/plain"
      
      # Analytics operations
      - get:
          url: "/api/analytics/overview"
          headers:
            Authorization: "Bearer {{ token }}"
      
      # Logout
      - post:
          url: "/api/auth/logout"
          headers:
            Authorization: "Bearer {{ token }}"